////
//// Created by 沙龙腾 on 2020-03-05.
////
///**
// * 一个正整数,如果它能被7整除,或者它的十进制表示法中某个位数上的数字为7,则称其为与7相关的数.
// * 现求所有小于等于n(n<100)的与7无关的正整数的平方和。
// *
// * 输入为一行,正整数n,(n<100)
// */
//#include <stdio.h>
//int main()
//{
//    //不给n初始化，n有一个默认值
//    int n,sum=0;
//    int tmp;
//    printf("请输入n,n<100\n");
//    scanf("%d",&n);
//    for (int i = 0; i < n; ++i)
//    {
//        //不能修改i 的值，除等于 可以拿到十位上的数字
//        tmp = i;
//        if((tmp % 7!= 0) && (tmp % 10 !=7) && ((tmp/=10) %10 !=7))
//        {
//            sum+=i*i;
//        }
//    }
//    printf("与7无关的正整数的平方和是：%d",sum);
//    return 0;
//}